import random
LINE = '=' * 35 + '>'

easy_questions = [
      'Кой е авторът на стихотворението "Аз съм българче?"',
      'През коя година е основана България?',
      'Кой български революционер е наречен Апостолът на свободата?',
      'Кой е единственият български футболист печелил златната топка?',
      'Какво се случи на 11 септември 2001 година?',
      'Какво не трябва да вижда младоженецът преди сватбата според разпространеното суеверие?',
      'Според думите на атинския законодател Солон тайната на вечната младост е всеки ден:',
      'Кой се крие "от думи хорски" в Дядовата ръкавичка?',
      'Кое от следните е разговорно название на устройство за интернет?',
      'На кого е принадлежал най-известният дневник в света?',
      'Колко на брой са буквите в българската азбука?',
      'Кое се поставя първо при строеж на сграда?',
      'На коя настолна игра не се хвърлят зарове за да се определи движението на пионките?',
      'Кой цитат е от анимационния герой "Мечо Пух"?',
      'Какви продукти може да си закупите от кинкалерията?',
      'Как се нарича наподобяващо палачинка ястие, характерно за Странджанско и Родопите?',
      'Как продължава заглавието на приказката "Който не работи не трябва:"',
      'Кой ден е определен за "Международен ден на жената"?',
      'Кой изрича знаменитата фраза "Господ е българин"?',
      'Кое от разговорните наименования за куче е едновременно и име на пръст на ръката?',
      'Кой бил най-важен и господар в семейството на траките?',
      'В близост до кой български град се намира местността "Узана"?',
      'За кое съкровище се отнася описанието: Състои се от 9 златни съда и често се изнася на изложения в Европа',
      'Какво пие човек, претърпял разочарование или несполука, според популярния израз?',
      'Кои митологични същества се срещат в българските предания и легенди?',
      'Три гълъба тежат колкото 2 фазана. Kолко гълъба тежат 6 фазана?',
      'Кое твърдение за България не е вярно?',
      'Кое от изброените не е държавен символ?',
      'Кой от празниците не е официален в България?',
      'Как се казва хубавицата, която турците искат да вземат в народната песен "Даваш ли, даваш, Балканджи Йово"?'
]

normal_questions = [
    'Кой древногръцки философ се смята за основоположник на историята?',
    'От кое стихотворение е този куплет? "Ох, зная, зная, ти плачеш, майко, затуй, че ти си черна робиня, затуй, '
    'че твоят свещен глас, майко, е глас без помощ, глас във пустиня."',
    'Коя река се намира на континента Южна Америка?',
    'От кой език произлиза думата "робот"?',
    'От кой български филм е репликата "Ай сиктир, ще и свиря десет дена под прозореца… Да не е Лайза Минели!',
    'Кои от следните числа са подредени в геометрична прогресия?',
    'С коя професионална прослойка е обвързан "Левски" през 1949 година?',
    'Баснята е?',
    '"Никой не може да си присвои чуждото щастие." За коя приказка се отнася тази поука?',
    'Какво представлява легендата?',
    'Кой е древногръцкият бог на светлината?',
    'Коя е любимата дъщеря на Зевс?',
    'Как буквално се превежда на български език думата „философия“?',
    'Как се нарича местността в която се намира скалното образование "Тримата братя"?',
    'На коя страна е била кралица Ан Болейн?',
    'Кое от следните в северозападна България наричат пукница?',
    'Кой е единственият български филм, на който е правен римейк?',
    'Кое от изброените е забележително място в Скандинавската митология, но не и в Гръцката?',
    'През XVI и XVII век "Хугенотите" са преследвани и избивани от Луи XIV защото са били:',
    'Кой български град в миналото е носил името Аполония?',
    'Какво е било името на град Варна през древността?',
    'Коя страна може да се похвали със свой собствен Музей на килимите с външен вид, проектиран да прилича на стан.',
    'Колко градуса е разликата между изправения и правия ъгъл?',
    'Познавач и експерт в приготвянето на какво е професионалният "бариста"?',
    'Името на кой оцветен в зелено плод носи името на австралийската градинарка Грани Смит?',
    'Колко на брой са човешките раси?',
    'Коя от страните се счита за най-старата република в света?',
    'Коя е първата печатна книга в новобългарската литература?',
    'Коя е родината на популярното по цял свят бохемско стъкло?',
    'През коя година е създадена "Организация на обединените нации (ООН)"?'
]

professional_questions = [
    'Какво е Хомо Хабилис?',
    'Бразилия граничи с всички държави на континента Южна Америка освен с две, кои са те?',
    'Храмът на Артемида е едно от 7-те чудеса на Античния свят, в кой град се е намирал този храм?',
    'Коя е най-голямата по площ държава в Африка?',
    'Къде е родено мечето Падингтън, герой от известната детска книжна поредица?',
    'Коя физична единица е кръстена на италиански аристократ?',
    'Какво са вграждали старите българи в основите на строеж, за да го предпазят от разрушаване?',
    'Каква е била професията на композитора Александър Бородин?',
    'На коя от следните личности НЕ е кръстен химичен елемент?',
    'Територията на коя държава се намира изцяло в територията на друга държава?',
    'На колко мили приблизително се намира Земята от Слънцето?',
    'С каква специалност руският драматург Антон Чехов завършва Московския университет?',
    'За да си върне Евредика, Орфей слязъл в подземното царство на Хадес. Коя е пещерата, през която е минал за стигне до там?',
    'През коя година се е провела първата олимпиада в Елада?',
    'Молекулната формула на метана е:',
    'Кой е изобретателят на първата ваксина против бяс?',
    'Коя цивилизация била наречена "първите европейци"?',
    'Колко сенатори има в Сента на САЩ?',
    'Тъй като се дели равномерно на всяко цяло число между 1 и 10, кое според Платон е идеалното число?',
    'Статуята на коя личност е изестна като "Статуята на трите лъжи"?',
    'Как се казва най-древната настолна игра',
    'Кралица Виктория е седяла на британския трон 63 години, от кой президент на САЩ до кой?',
    'Кой писател свидетелства, че в своя творба е изобразил себе си "под името на младия поет Бръчков"?',
    'Името на коя държава означава "Земя на арийците"?',
    'Кое тракийско племе създало държава на Балканите?',
    'Коя фамилия не е част от Петте фамилии контролищи престъпността в Ню Йорк?',
    'Кой султан на Османската империя е бил известен с прозвището "Завоевателят"?',
    'Кой е бил знаменосец на четата на Панайот Хитов, преминала Дунава при Тутракан през 1867?',
    'Кога Капитан Петко Войвода получава за първи път прозвището "Капитан"?',
    'В кой европейски град се намира "Паметник на чумата"?',

]

possible_answers = {
    'Кой е авторът на стихотворението "Аз съм българче?"': ['Христо Ботев', 'Елин Пелин', 'Иван Вазов',
                                                           'Ангел Каралийчев'],
    'През коя година е основана България?': ['681', '581', '722', '1184'],
    'Кой български революционер е наречен Апостолът на свободата?': ['Георги Сава Раковски', 'Христо Ботев', 'Стефан Караджа', 'Васил Левски'],
    'Кой е единственият български футболист печелил златната топка?': ['Христо Стоичков', 'Георги Аспарухов-Гунди', 'Димитър Бербатов', 'Петър Жеков'],
    'Кой древногръцки философ се смята за основоположник на историята?': ['Талес', 'Платон', 'Сократ', 'Херодот'],
    'От кое стихотворение е този куплет? "Ох, зная, зная, ти плачеш, майко, затуй, '
    'че ти си черна робиня, затуй, че твоят свещен глас, майко, е глас без помощ, глас във пустиня."': ['Хаджи Димитър', 'Обесването на Васил Левски', 'На прощаване', 'Майце си'],
    'Коя река се намира на континента Южна Америка?': ['Ефрат', 'Волга', 'Амазонка', 'Нил'],
    'Какво е Хомо Хабилис?': ['Изправен човек', 'Южна маймуна', 'Разумен човек', 'Сръчен човек'],
    'Бразилия граничи с всички държави на континента Южна Америка освен с две, кои са те?': ['Венецуела-Уругвай', 'Чили-Еквадор', 'Боливия-Перу', 'Парагвай-Колумбия'],
    'Храмът на Артемида е едно от 7-те чудеса на Античния свят, в кой град се е намирал този храм?': ['Ефес', 'Вавилон', 'Александрия', 'Ниневия'],
    'Коя е най-голямата по площ държава в Африка?': ['Демократична република Конго', 'Алжир', 'Нигерия', 'Южна Африка'],
    'Къде е родено мечето Падингтън, герой от известната детска книжна поредица?': ['Индия', 'Перу', 'Канада', 'Англия'],
    'От кой език произлиза думата "робот"?': ['Френски', 'Немски', 'Чешки', 'Латински'],
    'Какво се случи на 11 септември 2001 година?': ['СССР нахлу в Афганистан', 'Бяха взривени кулите близнаци', 'САЩ нападна Либия', 'Падна Берлинската стена'],
    'От кой български филм е репликата "Ай сиктир, ще и свиря десет дена под прозореца… Да не е Лайза Минели!': ['Оркестър без име', 'Баш Майстора на море', 'Топло', 'Дами канят'],
    'Кои от следните числа са подредени в геометрична прогресия?': ['1,2,3,4', '1,3,5,7', '1,0,2,0', '2,4,8,16'],
    'Коя физична единица е кръстена на италиански аристократ?': ['Паскал', 'Ом', 'Волт', 'Херц'],
    'Какво са вграждали старите българи в основите на строеж, за да го предпазят от разрушаване?': ['Ризата на майстора', 'Сълзите на малко дете', 'Дървен кръст', 'Човешка сянка'],
    'Какво не трябва да вижда младоженецът преди сватбата според разпространеното суеверие?': ['Роклята на булката', 'Обувките на шаферките', 'Банковата сметка на кума', 'Точилката на тъщата'],
    'Според думите на атинския законодател Солон тайната на вечната младост е всеки ден:': ['Да се чете на глас', 'Да се учи нещо ново', 'Да се смята на ум', 'Да се пише огледално'],
    'С коя професионална прослойка е обвързан "Левски" през 1949 година?': ['С БДЖ', 'С полицията', 'С миньорите', 'С пощите'],
    'Кой се крие "от думи хорски" в Дядовата ръкавичка?': ['Мишчица Гризана', 'Вълчо от Балкана', 'Рошава Мецана', 'Зайо Средногорски'],
    'Кое от следните е разговорно название на устройство за интернет?': ['Мъфинче', 'Макаронче', 'Бонбонка', 'Бисквитка'],
    'Каква е била професията на композитора Александър Бородин?': ['капитан на флота', 'химик', 'адвокат', 'шеф готвач'],
    'На коя от следните личности НЕ е кръстен химичен елемент?': ['Алберт Айнщайн', 'Нилс Бор', 'Исак Нютон', 'Енрико Ферми'],
    'Територията на коя държава се намира изцяло в територията на друга държава?': ['Лесото', 'Буркина Фасо', 'Монголия', 'Люксембург'],
    'На колко мили приблизително се намира Земята от Слънцето?': ['9,3 милиона', '39 милиона', '93 милиона', '193 милиона'],
    'С каква специалност руският драматург Антон Чехов завършва Московския университет?': ['право', 'медицина', 'философия', 'икономика'],
    'Баснята е?':
        ['кратък текст, в който народната мъдрост е събрана в едно-единствено изречение',
         'творба, която най-често се изпълнява от актьори в театъра',
         'кратък текст, в който задължително има поука, а героите най-често са животни',
         'кратък текст за въздействие върху болен човек'],
    '"Никой не може да си присвои чуждото щастие." За коя приказка се отнася тази поука?': ['Човекът и змията', 'Сестричката Альонушка и братчето Иванушка', 'Мъдрото момче', 'Князът и златният трендафил'],
    'Какво представлява легендата?': ['Кратък текст, оформен като въпрос.',
                                      'Кратък текст с преносно значение, с който се изказва някаква мъдрост.',
                                      'Текст в стихотворна форма, който изразява чувства, мисли и преживявания.',
                                      'Предание за минали събития, в което действителното е примесено с измислици.'],
    'Кой е древногръцкият бог на светлината?': ['Кронос', 'Хефест', 'Арес', 'Аполон'],
    'Коя е любимата дъщеря на Зевс?': ['Атина', 'Артемида', 'Деметра', 'Афродита'],
    'На кого е принадлежал най-известният дневник в света?': ['Ане Франк', 'Кралица Елизабет', 'Виктория Бекъм', 'Опра Уинфри'],
    'Колко на брой са буквите в българската азбука?': ['28', '30', '32', '35'],
    'Кое се поставя първо при строеж на сграда?': ['Основите', 'Терасите', 'Прозорците', 'Кабелът за интернет'],
    'На коя настолна игра не се хвърлят зарове за да се определи движението на пионките?':
        ['Не се сърди, човече', 'Монополи', 'Шах', 'Табла'],
    'Как буквално се превежда на български език думата „философия“?': ['Познай себе си', 'Мъдрост', 'Търси мъдростта', 'Любов към мъдростта'],
    'Как се нарича местността в която се намира скалното образование "Тримата братя"?': ['Златните мостове', 'Казаните', 'Сините камъни', 'Сополиви камъни'],
    'За да си върне Евредика, Орфей слязъл в подземното царство на Хадес. '
    'Коя е пещерата, през която е минал за стигне до там?':
        ['Ласко', 'Алтемира', 'Дяволското гърло', 'Козарника'],
    'През коя година се е провела първата олимпиада в Елада?': ['5508 г.пр.Хр', '776 г.пр.Хр', '753 г.пр.Хр', '622 г.'],
    'Кой цитат е от анимационния герой "Мечо Пух"?': ['Не колко дълго, а колко добре си живял е основното.',
                                                     'Колкото Повече, Толкова Повече!',
                                                     'Неизследваният живот не си струва да се живее.',
                                                     'Възнамерявам да живея живота, а не просто да съществувам.'],
    'Какви продукти може да си закупите от кинкалерията?': ['Шивашки материали', 'Алкохол и цигари', 'Лотарийни билети',
                                                            'Дрехи втора употреба'],
    'Как се нарича наподобяващо палачинка ястие, характерно за Странджанско и Родопите?':
        ['Капама', 'Каварма', 'Катма', 'Ошав'],
    'На коя страна е била кралица Ан Болейн?': ['Швеция', 'Франция', 'Англия', 'Испания'],
    'Молекулната формула на метана е:': ['C4H', 'CH4', 'C4H4', 'CH'],
    'Кой е изобретателят на първата ваксина против бяс?': ['Роберт Кох', 'Луи Пастьор', 'Вилхелм Конрад ', 'Игнац Филип Земелвайс'],
    'Кое от следните в северозападна България наричат пукница?': ['Новогодишната заря', 'Ракията', 'Ловната пушка', 'Царевицата'],
    'Как продължава заглавието на приказката "Който не работи не трябва:"': ['да получава заплата', 'да има приятели', 'да яде', 'да дава акъл'],
    'Кой е единственият български филм, на който е правен римейк?': ['Време разделно', 'Осъдени души', 'Козият рог', 'Маргарит и Маргарита'],
    'Коя цивилизация била наречена "първите европейци"?': ['Троянците', 'Ахейците', 'Спартанците', 'Минойците'],
    'Кое от изброените е забележително място в Скандинавската митология, но не и в Гръцката?': ['Планината Олимп', 'Елисейски полета', 'Тартар', 'Валхала'],
    'Колко сенатори има в Сента на САЩ?': ['50', '51', '100', '102'],
    'Тъй като се дели равномерно на всяко цяло число между 1 и 10, кое според Платон е идеалното число?': ['1880', '3450', '5040', '7770'],
    'През XVI и XVII век "Хугенотите" са преследвани и избивани от Луи XIV защото са били:': ['католици', 'протестанти', 'християни', 'мюсюлмани'],
    'Статуята на коя личност е изестна като "Статуята на трите лъжи"?': ['Уди Алън', 'Боб Марли', 'Хенри Уинклър', 'Джон Харвард'],
    'Как се казва най-древната настолна игра': ['Го', 'Сенет', 'Маджонг', 'Шах'],
    'Кой ден е определен за "Международен ден на жената"?': ['8-ми Март', '1-ви Април', '1-ви Юни', '6-ти Септември'],
    'Кой български град в миналото е носил името Аполония?': ['Габрово', 'Кюстендил', 'Созопол', 'Добрич'],
    'Кой изрича знаменитата фраза "Господ е българин"?': ['Алекси Сокачев', 'Пепи Бакърджиев', 'Асен Спиридонов', 'Николай Колев-Мичмана'],
    'Какво е било името на град Варна през древността?': ['Одесос', 'Месембрия', 'Масалия', 'Филипополис'],
    'Коя страна може да се похвали със свой собствен Музей на килимите с външен вид, проектиран да прилича на стан.': ['Швеция', 'Бразилия', 'Иран', 'Уганда'],
    'Кралица Виктория е седяла на британския трон 63 години, от кой президент на САЩ до кой?':
        ['Джон Адамс до Ейбрахам Линкълн ', 'Юлисис Грант до Удроу Уилсън', 'Мартин Ван Бюрън до Уилям Маккинли', 'Андрю Джаксън до Хърбърт Хувър'],
    'Колко градуса е разликата между изправения и правия ъгъл?': ['30', '45', '90', '180'],
    'Познавач и експерт в приготвянето на какво е професионалният "бариста"?': ['Пица', 'Кафе', 'Дюнер', 'Гофрета'],
    'Кой писател свидетелства, че в своя творба е изобразил себе си "под името на младия поет Бръчков"?':
        ['Любен Каравелов', 'Петко Славейков', 'Иван Вазов', 'Захари Стоянов'],
    'Кое от разговорните наименования за куче е едновременно и име на пръст на ръката?': ['Пес', 'Кутре', 'Вълкодав', 'Балкан'],
    'Името на кой оцветен в зелено плод носи името на австралийската градинарка Грани Смит?': ['Ябълка', 'Лайм', 'Авокадо', 'Смокиня'],
    'Името на коя държава означава "Земя на арийците"?': ['Мавритания', 'Гърция', 'Монголия', 'Иран'],
    'Кой бил най-важен и господар в семейството на траките?': ['Синът', 'Дъщерята', 'Мъжът', 'Жената'],
    'Колко на брой са човешките раси?': ['3', '4', '7', '12'],
    'Кое тракийско племе създало държава на Балканите?': ['Беси', 'Трибали', 'Одриси', 'Гети'],
    'Коя фамилия не е част от Петте фамилии контролищи престъпността в Ню Йорк?': ['Бонано', 'Медичи', 'Гамбино', 'Дженовезе'],
    'Кой султан на Османската империя е бил известен с прозвището "Завоевателят"?': ['Баязид II', 'Мехмед II', 'Мурад II', 'Сюлейман Великолепни'],
    'Кой е бил знаменосец на четата на Панайот Хитов, преминала Дунава при Тутракан през 1867?': ['Тодор Каблешков', 'Васил Левски', 'Георги Раковски', 'Филип Тотю'],
    'Кога Капитан Петко Войвода получава за първи път прозвището "Капитан"?':
        ['След Априлското въстание', 'След Кресненско-Разложкото въстание', 'След Критското въстание', 'Горноджумайското въстание'],
    'В кой европейски град се намира "Паметник на чумата"?': ['Лондон', 'Париж', 'Виена', 'Будапеща'],
    'Коя от страните се счита за най-старата република в света?': ['България', 'Китай', 'Сан Марино', 'Франция'],
    'Коя е първата печатна книга в новобългарската литература?': ['Неделник', 'Абагар', 'Стематография', 'Рибен буквар'],
    'В близост до кой български град се намира местността "Узана"?': ['Смолян', 'Габрово', 'Русе', 'Елхово'],
    'За кое съкровище се отнася описанието: Състои се от 9 златни съда и често се изнася на изложения в Европа':
        ['Панагюрско съкровище', 'Рогозенско съкровище', 'Вълчитрънско съкровище', 'Летнишко съкровище'],
    'Какво пие човек, претърпял разочарование или несполука, според популярния израз?':
        ['200гр. гроздова', 'Една студена вода', 'Две розови хапчета', 'Каса бира'],
    'Кои митологични същества се срещат в българските предания и легенди?': ['Тролове', 'Нимфи', 'Караконджули', 'Сирени'],
    'Три гълъба тежат колкото 2 фазана. Kолко гълъба тежат 6 фазана?': ['3 гълъба', '6 гълъба', '9 гълъба', '12 гълъба'],
    'Коя е родината на популярното по цял свят бохемско стъкло?': ['Полша', 'Румъния', 'Чехия', 'Естония'],
    'През коя година е създадена "Организация на обединените нации (ООН)"?': ['1919', '1945', '1965', '1980'],
    'Кое твърдение за България не е вярно?':
        ['България е парламентарна република', 'България членува в ООН, НАТО, ЕС', 'България е унитарна държава', 'България е федеративна държава'],
    'Кое от изброените не е държавен символ?': ['Националният химн', 'Националното знаме', 'Държавните граници', 'Държавният герб'],
    'Кой от празниците не е официален в България?': ['3-ти Март', '24-ти Май', '6-ти Септември', '6-ти Декември'],
    'Как се казва хубавицата, която турците искат да вземат в народната песен "Даваш ли, даваш, Балканджи Йово"?': ['Елица', 'Мария', 'Яна', 'Гергана']
}

correct_answer = {
    'Кой е авторът на стихотворението "Аз съм българче?"': ['Иван Вазов'],
    'През коя година е основана България?': ['681'],
    'Кой български революционер е наречен Апостолът на свободата?': ['Васил Левски'],
    'Кой е единственият български футболист печелил златната топка?': ['Христо Стоичков'],
    'Кой древногръцки философ се смята за основоположник на историята?': ['Херодот'],
    'От кое стихотворение е този куплет? "Ох, зная, зная, ти плачеш, майко, затуй, че ти си черна робиня, '
    'затуй, че твоят свещен глас, майко, е глас без помощ, глас във пустиня."': ['Обесването на Васил Левски'],
    'Коя река се намира на континента Южна Америка?': ['Амазонка'],
    'Какво е Хомо Хабилис?': ['Сръчен човек'],
    'Бразилия граничи с всички държави на континента Южна Америка освен с две, кои са те?': ['Чили-Еквадор'],
    'Храмът на Артемида е едно от 7-те чудеса на Античния свят, в кой град се е намирал този храм?': ['Ефес'],
    'Коя е най-голямата по площ държава в Африка?': ['Алжир'],
    'Къде е родено мечето Падингтън, герой от известната детска книжна поредица?': ['Перу'],
    'От кой език произлиза думата "робот"?': ['Чешки'],
    'Какво се случи на 11 септември 2001 година?': ['Бяха взривени кулите близнаци'],
    'От кой български филм е репликата "Ай сиктир, ще и свиря десет дена под прозореца… Да не е Лайза Минели!': ['Оркестър без име'],
    'Кои от следните числа са подредени в геометрична прогресия?': ['2,4,8,16'],
    'Коя физична единица е кръстена на италиански аристократ?': ['Волт'],
    'Какво са вграждали старите българи в основите на строеж, за да го предпазят от разрушаване?': ['Човешка сянка'],
    'Какво не трябва да вижда младоженецът преди сватбата според разпространеното суеверие?': ['Роклята на булката'],
    'Според думите на атинския законодател Солон тайната на вечната младост е всеки ден:': ['Да се учи нещо ново'],
    'С коя професионална прослойка е обвързан "Левски" през 1949 година?': ['С пощите'],
    'Кой се крие "от думи хорски" в Дядовата ръкавичка?': ['Зайо Средногорски'],
    'Кое от следните е разговорно название на устройство за интернет?': ['Бисквитка'],
    'Каква е била професията на композитора Александър Бородин?': ['химик'],
    'На коя от следните личности НЕ е кръстен химичен елемент?': ['Исак Нютон'],
    'Територията на коя държава се намира изцяло в територията на друга държава?': ['Лесото'],
    'На колко мили приблизително се намира Земята от Слънцето?': ['93 милиона'],
    'С каква специалност руският драматург Антон Чехов завършва Московския университет?': ['медицина'],
    'Баснята е?': ['кратък текст, в който задължително има поука, а героите най-често са животни'],
    '"Никой не може да си присвои чуждото щастие." За коя приказка се отнася тази поука?': ['Князът и златният трендафил'],
    'Какво представлява легендата?': ['Предание за минали събития, в което действителното е примесено с измислици.'],
    'Кой е древногръцкият бог на светлината?': ['Аполон'],
    'Коя е любимата дъщеря на Зевс?': ['Атина'],
    'На кого е принадлежал най-известният дневник в света?': ['Ане Франк'],
    'Колко на брой са буквите в българската азбука?': ['30'],
    'Кое се поставя първо при строеж на сграда?': ['Основите'],
    'На коя настолна игра не се хвърлят зарове за да се определи движението на пионките?': ['Шах'],
    'Как буквално се превежда на български език думата „философия“?': ['Любов към мъдростта'],
    'Как се нарича местността в която се намира скалното образование "Тримата братя"?': ['Казаните'],
    'За да си върне Евредика, Орфей слязъл в подземното царство на Хадес. Коя е пещерата, през която е минал за стигне до там?': ['Дяволското гърло'],
    'През коя година се е провела първата олимпиада в Елада?': ['776 г.пр.Хр'],
    'Кой цитат е от анимационния герой "Мечо Пух"?': ['Колкото Повече, Толкова Повече!'],
    'Какви продукти може да си закупите от кинкалерията?': ['Шивашки материали'],
    'Как се нарича наподобяващо палачинка ястие, характерно за Странджанско и Родопите?': ['Катма'],
    'На коя страна е била кралица Ан Болейн?': ['Англия'],
    'Молекулната формула на метана е:': ['CH4'],
    'Кой е изобретателят на първата ваксина против бяс?': ['Луи Пастьор'],
    'Кое от следните в северозападна България наричат пукница?': ['Ракията'],
    'Как продължава заглавието на приказката "Който не работи не трябва:"': ['да яде'],
    'Кой е единственият български филм, на който е правен римейк?': ['Козият рог'],
    'Коя цивилизация била наречена "първите европейци"?': ['Минойците'],
    'Кое от изброените е забележително място в Скандинавската митология, но не и в Гръцката?': ['Валхала'],
    'Колко сенатори има в Сента на САЩ?': ['100'],
    'Тъй като се дели равномерно на всяко цяло число между 1 и 10, кое според Платон е идеалното число?': ['5040'],
    'През XVI и XVII век "Хугенотите" са преследвани и избивани от Луи XIV защото са били:': ['протестанти'],
    'Статуята на коя личност е изестна като "Статуята на трите лъжи"?': ['Джон Харвард'],
    'Как се казва най-древната настолна игра': ['Сенет'],
    'Кой ден е определен за "Международен ден на жената"?': ['8-ми Март'],
    'Кой български град в миналото е носил името Аполония?': ['Созопол'],
    'Кой изрича знаменитата фраза "Господ е българин"?': ['Николай Колев-Мичмана'],
    'Какво е било името на град Варна през древността?': ['Одесос'],
    'Коя страна може да се похвали със свой собствен Музей на килимите с външен вид, проектиран да прилича на стан.': ['Иран'],
    'Кралица Виктория е седяла на британския трон 63 години, от кой президент на САЩ до кой?':
        ['Мартин Ван Бюрън до Уилям Маккинли'],
    'Колко градуса е разликата между изправения и правия ъгъл?': ['90'],
    'Познавач и експерт в приготвянето на какво е професионалният "бариста"?': ['Кафе'],
    'Кой писател свидетелства, че в своя творба е изобразил себе си "под името на младия поет Бръчков"?': ['Иван Вазов'],
    'Кое от разговорните наименования за куче е едновременно и име на пръст на ръката?': ['Кутре'],
    'Името на кой оцветен в зелено плод носи името на австралийската градинарка Грани Смит?': ['Ябълка'],
    'Името на коя държава означава "Земя на арийците"?': ['Иран'],
    'Кой бил най-важен и господар в семейството на траките?': ['Мъжът'],
    'Колко на брой са човешките раси?': ['3'],
    'Кое тракийско племе създало държава на Балканите?': ['Одриси'],
    'Коя фамилия не е част от Петте фамилии контролищи престъпността в Ню Йорк?': ['Медичи'],
    'Кой султан на Османската империя е бил известен с прозвището "Завоевателят"?': ['Мехмед II'],
    'Кой е бил знаменосец на четата на Панайот Хитов, преминала Дунава при Тутракан през 1867?': ['Васил Левски'],
    'Кога Капитан Петко Войвода получава за първи път прозвището "Капитан"?': ['След Критското въстание'],
    'В кой европейски град се намира "Паметник на чумата"?': ['Виена'],
    'Коя от страните се счита за най-старата република в света?': ['Сан Марино'],
    'Коя е първата печатна книга в новобългарската литература?': ['Неделник'],
    'В близост до кой български град се намира местността "Узана"?': ['Габрово'],
    'За кое съкровище се отнася описанието: Състои се от 9 златни съда и често се изнася на изложения в Европа': ['Панагюрско съкровище'],
    'Какво пие човек, претърпял разочарование или несполука, според популярния израз?': ['Една студена вода'],
    'Кои митологични същества се срещат в българските предания и легенди?': ['Караконджули'],
    'Три гълъба тежат колкото 2 фазана. Kолко гълъба тежат 6 фазана?': ['9 гълъба'],
    'Коя е родината на популярното по цял свят бохемско стъкло?': ['Чехия'],
    'През коя година е създадена "Организация на обединените нации (ООН)"?': ['1945'],
    'Кое твърдение за България не е вярно?': ['България е федеративна държава'],
    'Кое от изброените не е държавен символ?': ['Държавните граници'],
    'Кой от празниците не е официален в България?': ['6-ти Декември'],
    'Как се казва хубавицата, която турците искат да вземат в народната песен "Даваш ли, даваш, Балканджи Йово"?': ['Яна']
}

explanations = {
    'Кой е авторът на стихотворението "Аз съм българче?"':
        ['Стихотворението "Аз съм българче" е написано и публикувано през 1919 година от Иван Вазов.'],
    'През коя година е основана България?': ['Първата българска държава е основана от Хан Аспарух през 681г. '
                                             'Категоричната победа на прабългарите в битката при Онгъла през 680 г. '
                                             'води до подписване на мирен договор, с който Византия признава '
                                             'новосъздадената държава.'
                                             ' '],
    'Кой български революционер е наречен Апостолът на свободата?':
        ['Васил Иванов Кунчев е български революционер отдал живота си за свободата на България. '
                                                                     'Повече за живота на Левски може да научиш тук: '
                                                                     'https://bulgarianhistory.org/vasil-levski-apostola-na-svobodata/'],
    'Кой е единственият български футболист печелил златната топка?':
        ['През 1994 година на световното в САЩ Христо '
                                                                       'Стоичков става голмайстор и печели златната топка. '
                                                                       'Повече за живота на Стоичков може да научиш тук: '
                                                                       'https://bulgarianhistory.org/hristo-stoichkov/'],
    'Кой древногръцки философ се смята за основоположник на историята?': ['Херодот е древногръцки историк. '
                                                                          'Известен е преди всичко с първата книга от '
                                                                          'исторически характер, История, поради което е'
                                                                          ' наричан „баща на историята“.'],
    'От кое стихотворение е този куплет? "Ох, зная, зная, ти плачеш, майко, затуй, че ти си черна робиня, затуй, '
    'че твоят свещен глас, майко, е глас без помощ, глас във пустиня."': ['Куплетът е от Обесването на Васил Левски. '
                                                                          'Тук можеш да прочетеш произведението: '
                                                                          'http://www.slovo.bg/showwork.php3?AuID=1&Level=1&WorkID=3164'],
    'Коя река се намира на континента Южна Америка?': ['Амазонка е река в северната част на Южна Америка, смятана за '
                                                       'най-голямата в света, защото е най-пълноводната и притежава '
                                                       'най-обширния водосборен басейн.'],
    'Какво е Хомо Хабилис?': ['Сръчният човек (Homo habilis) е изчезнал вид от род Човек, '
                              'живял преди приблизително 2,5 до 1,8 милиона години.'],
    'Бразилия граничи с всички държави на континента Южна Америка освен с две, кои са те?': ['Бразилия има обща граница '
                                                                                             'с всяка държава от Южна Америка,'
                                                                                             ' с изключение на Еквадор и Чили.'],
    'Храмът на Артемида е едно от 7-те чудеса на Античния свят, в кой град се е намирал този храм?': ['Храмът на Артемида е древногръцки храм, '
                                                                                                      'най-големият през античността. '
                                                                                                      'Намирал се е в град Ефес днешна Турция.'],
    'Коя е най-голямата по площ държава в Африка?': ['С площ от 2 381 714 km2 Алжир е най-голямата по площ държава в Африка.'],
    'Къде е родено мечето Падингтън, герой от известната детска книжна поредица?': ['Падингтън е мече чийто дом в Перу е унищожен от земетресение и то се преселва в Англия.'],
    'От кой език произлиза думата "робот"?': ['Думата „робот“ произлиза от чешката дума „robota“, означаваща работа, но и ангария, изморителен труд (робски труд).'],
    'Какво се случи на 11 септември 2001 година?': ['На 11 септември 2001 г. Световният търговски център става сцена на '
                                                    'най-мащабния терористичен акт в света към днешна дата. '
                                                    'Във всяка една от двете кули се блъска по един самолет.'],
    'От кой български филм е репликата "Ай сиктир, ще и свиря десет дена под прозореца… Да не е Лайза Минели!':
        ['„Оркестър без име“ е български игрален филм (комедия), заснет през 1980 година от режисьора Людмил Кирков по сценарий на Станислав Стратиев.'],
    'Кои от следните числа са подредени в геометрична прогресия?': ['В математиката геометрична прогресия е редица от '
                                                                    'числа, в която първото число е различно от нула, '
                                                                    'а всяко друго число е получено от предишното чрез '
                                                                    'умножение с константа, различна от нула.'],
    'Коя физична еденица единица е кръстена на италиански аристократ?': ['Тазк единица е кръстена на италианския физик Алесандро Волта'],
    'Какво са вграждали старите българи в основите на строеж, за да го предпазят от разрушаване?':
        ['Вграждането на сянка е български ритуал, познат в Балканския фолклор. '
         'Според легендата, млада жена (или сянката ѝ) бива зазидана жива в основите на мост или сграда, за да омилостиви бога, който руши строежа.'],
    'Какво не трябва да вижда младоженецът преди сватбата според разпространеното суеверие?':
        ['Едно от най-разпространените сватбени поверия и суеверия е, че младоженеца не трябва да вижда булката в сватбената рокля преди сватбата. Не трябва да вижда и самата рокля.'],
    'Според думите на атинския законодател Солон тайната на вечната младост е всеки ден:':
        ['„Тайната на вечната младост е всеки ден да учим по нещо ново“ – Солон е казал това преди много векове.'],
    'С коя професионална прослойка е обвързан "Левски" през 1949 година?':
        ['С решение на ЦК на БКП, клубът, създаден през 1914 година е закрит юридически. '
         'После на негово място е създаден новият СО Динамо клубът е прикрепен към ситемата на пощите.'],
    'Кой се крие "от думи хорски" в Дядовата ръкавичка?':
        ['Аз съм Зайо Средногорски, крия се от думи хорски. Линк към стихчето: https://chitanka.info/text/5740-djadovata-rykavichka'],
    'Кое от следните е разговорно название на устройство за интернет?':
        ['Устройство, което действа като преносим рутер и има форма на бисквитка'],
    'Каква е била професията на композитора Александър Бородин?':
        ['Александър Порфѝриевич Бородѝн е руски композитор от Могъщата петорка, музикант-инструменталист и химик'],
    'На коя от следните личности НЕ е кръстен химичен елемент?':
        ['Исак Нютон е английски физик, математик, астроном, философ, алхимик и богослов.'],
    'Територията на коя държава се намира изцяло в територията на друга държава?':
        ['Лесото е обкръжена изцяло от държавата ЮАР, а така разположена държава се нарича "анклав".'],
    'На колко мили приблизително се намира Земята от Слънцето?':
        ['1 миля е приблизително равна на 1.6 км. 93 милиона мили са почти 150 млн.км'],
    'С каква специалност руският драматург Антон Чехов завършва Московския университет?':
        ['Този велик писател винаги смята медицината за своя първа професия. Помага на бедните хора и ги лекува безплатно.'],
    'Баснята е?':
        ['кратък текст, в който задължително има поука, а героите най-често са животни. '
         'Може да прочетеш "Котка и мишки" от Езоп и "Паун и лястовичка" на Стоян Михайловски'],
    '"Никой не може да си присвои чуждото щастие." За коя приказка се отнася тази поука?':
        ['Тук може да прочетеш приказката: https://www.folklibrary.bg/bg/приказки/князът-и-злaтният-трендaфил'],
    'Какво представлява легендата?':
        ['Легендата е епически вид в литературата, предание за минали събития, в което се съчетават действително и измислено.'],
    'Кой е древногръцкият бог на светлината?': ['Аполон е богът на светлината. '
                                                'Повече за него тук: https://mitove-i-legendi.net/mitove-i-legendi/gurcia/grucki-bogove/'],
    'Коя е любимата дъщеря на Зевс?': ['Прочети за Атина Палада тук: http://ve-gea.blogspot.com/2011/08/athena-greek-goddess_06.html'],
    'На кого е принадлежал най-известният дневник в света?':
        ['Дневникът на Ане Франк излиза като книга през 1947г, със заглавие "Задната къща". Днес книгата е преведена на повече от 70 езика.'],
    'Колко на брой са буквите в българската азбука?': ['Буквите са 30'],
    'Кое се поставя първо при строеж на сграда?': ['Първо се поставят стабилни основи, защото без тях сградата ще се срути. '],
    'На коя настолна игра не се хвърлят зарове за да се определи движението на пионките?': ['Научи се да играеш шах тук: https://www.chess.com'],
    'Как буквално се превежда на български език думата „философия“?': ['Думата е създадена от 2-те Гръцки думи "Филос-Любов" и "Софос-Мъдрост"'],
    'Как се нарича местността в която се намира скалното образование "Тримата братя"?':
        ['Прочети за местността тук: https://opoznai.bg/view/skalen-fenomen-trite-bratia-aitos'],
    'За да си върне Евредика, Орфей слязъл в подземното царство на Хадес. '
    'Коя е пещерата, през която е минал за стигне до там?':
        ['Прочети за Орфей и Евредика тук: http://bgnasledstvo.org/bg/дяволското-гърло/'],
    'През коя година се е провела първата олимпиада в Елада?':
        ['776 г.пр.Хр. Прочети повече тук: https://bg.royalmarinescadetsportsmouth.co.uk/olympic-games'],
    'Кой цитат е от анимационния герой "Мечо Пух"?':
        ['Колкото Повече, Толкова Повече! Прочети тук: https://pojelaniq-bg.net/citati-misli-frazi-ot-na-mecho-puh.html'],
    'Какви продукти може да си закупите от кинкалерията?': ['Магазин за дребни изделия като (гребени, дантели, копчета и др.).'],
    'Как се нарича наподобяващо палачинка ястие, характерно за Странджанско и Родопите?':
        ['Катмите са ястие подобно на палачинки или гьозлеме'],
    'На коя страна е била кралица Ан Болейн?':
        ['Ан Болейн е кралица на Англия. Тя е втората съпруга на крал Хенри VIII и майка на кралица Елизабет I.'],
    'Молекулната формула на метана е:': ['Правилният отговор е CH4'],
    'Кой е изобретателят на първата ваксина против бяс?': ['Луи Пастьор е френски химик и биолог, той създава първите ваксини срещу бяс и антракс.'],
    'Кое от следните в северозападна България наричат пукница?': ['Епитет за ракия'],
    'Как продължава заглавието на приказката "Който не работи не трябва:"':
        ['Прочети приказката: https://bulgarianhistory.org/koito-ne-raboti-ne-trqbva-da-qde/'],
    'Кой е единственият български филм, на който е правен римейк?': ['Козият рог от 1972 г. и от 1994 г.'],
    'Коя цивилизация била наречена "първите европейци"?':
        ['Минойската цивилизация се развила между 2600 и 1100 г.пр.н.е и е определяна като най-ранната от този вид в Европа'],
    'Кое от изброените е забележително място в Скандинавската митология, но не и в Гръцката?':
        ['Валхала е небесен чертог, намиращ се в Асгард, един от деветте свята в скандинавската митология.'],
    'Колко сенатори има в Сента на САЩ?':
        ['Всеки щат е представен от двама сенатори, като общият брой на сенаторите е съответно 100.'],
    'Тъй като се дели равномерно на всяко цяло число между 1 и 10, кое според Платон е идеалното число?':
        ['5040 се дели равномерно с всички числа от 1 до 10'],
    'През XVI и XVII век "Хугенотите" са преследвани и избивани от Луи XIV защото са били:':
        ['Хугенотите са френските протестанти, които следват учението на богослова Джон Калвин.'],
    'Статуята на коя личност е изестна като "Статуята на трите лъжи"?':
        ['Прочети за Джон Харвард тук: https://bnr.bg/hristobotev/post/101040843'],
    'Как се казва най-древната настолна игра':
        ['Сенет е най-старата игра на дъска, за която има данни в наши дни. Възникнала е в Древен Египет около 3500г. пр.н.е.'],
    'Кой ден е определен за "Международен ден на жената"?': ['Международният ден на жената се празнува всяка година на 8 март.'],
    'Кой български град в миналото е носил името Аполония?': ['Созопол е наследник на гръцката колония Аполония.'],
    'Кой изрича знаменитата фраза "Господ е българин"?': ['Николай Колев-Мичмана след 2-я гол на Емил Костадинов на Парк Де Пренс.'],
    'Какво е било името на град Варна през древността?': ['В древността градът носи името Одесос.'],
    'Коя страна може да се похвали със свой собствен Музей на килимите с външен вид, проектиран да прилича на стан.':
        ['Музей на персийския килим в Иран'],
    'Кралица Виктория е седяла на британския трон 63 години, от кой президент на САЩ до кой?':
        ['Кралица Виктория управлява в периода 20 юни 1837 – 22 януари 1901'],
    'Колко градуса е разликата между изправения и правия ъгъл?': ['Изправеният ъгъл е 180 градуса а правият е 90'],
    'Познавач и експерт в приготвянето на какво е професионалният "бариста"?':
        ['Бариста е италианската дума за "барман", и той пригтовя кафе.'],
    'Кой писател свидетелства, че в своя творба е изобразил себе си "под името на младия поет Бръчков"?':
        ['Иван Вазов в повестта Немили-недраги'],
    'Кое от разговорните наименования за куче е едновременно и име на пръст на ръката?':
        ['Кутре наричаме най-малкия пръст на ръката'],
    'Името на кой оцветен в зелено плод носи името на австралийската градинарка Грани Смит?':
        ['Грани Смит е известна още като зелена ябълка или кисела ябълка.'],
    'Името на коя държава означава "Земя на арийците"?':
        ['Името на държавата Иран произлиза от терминаът арийски, значещ буквално „страна на арийците“.'],
    'Кой бил най-важен и господар в семейството на траките?': ['Тракиецът е бил господар в дома си.'],
    'Колко на брой са човешките раси?': ['Европеидна, Монголоидна, Негроидно-австралоидна'],
    'Кое тракийско племе създало държава на Балканите?':
        ['Одрисите създават Одриското царство, което съществувало от V в. пр. Хр до I в. сл. Хр.'],
    'Коя фамилия не е част от Петте фамилии контролищи престъпността в Ню Йорк?':
        ['Петте фамилии са: Бонано, Коломбо ,Гамбино, Дженовезе, Лучезе'],
    'Кой султан на Османската империя е бил известен с прозвището "Завоевателят"?':
        ['Мехмед II е наричан завоевателят заради успешната обсада на Константинопол, и ликвидирането на Византия.'],
    'Кой е бил знаменосец на четата на Панайот Хитов, преминала Дунава при Тутракан през 1867?':
        ['На 28 април 1867 г. Хитов преминава Дунав с чета от около 30 души. Знаменосец на четата е Васил Левски.'],
    'Кога Капитан Петко Войвода получава за първи път прозвището "Капитан"?':
        ['Прочети за Петко Войвода тук: https://bulgarianhistory.org/kapitan-petko-voivoda/'],
    'В кой европейски град се намира "Паметник на чумата"?':
        ['Колоната на чумата е разположена в центъра на една от най-известните улици на Виена.'],
    'Коя от страните се счита за най-старата република в света?': ['Сан Марино е най-старата конституционна република в света.'],
    'Коя е първата печатна книга в новобългарската литература?':
        ['„Неделник“ или „Софроние“ е първата печатна книга на новобългарски език.'],
    'В близост до кой български град се намира местността "Узана"?':
        ['В непосредствена близост до град Габрово се намира местността Узана'],
    'За кое съкровище се отнася описанието: Състои се от 9 златни съда и често се изнася на изложения в Европа':
        ['Панагюрско съкровище е комплект от 9 златни съда с общо тегло 6,164 кг.'],
    'Какво пие човек, претърпял разочарование или несполука, според популярния израз?': ['Верният отговор е "Една студена вода"'],
    'Кои митологични същества се срещат в българските предания и легенди?':
        ['Карако̀нджул е фолклорно създание, познато и сред съседните балкански народи.'],
    'Три гълъба тежат колкото 2 фазана. Kолко гълъба тежат 6 фазана?':
        ['3 гълъба = 2 фазана, 6 гълъба = 4 фазана, 9 гълъба = 6 фазана'],
    'Коя е родината на популярното по цял свят бохемско стъкло?': ['Родината на бохемското стъкло е Чехия'],
    'През коя година е създадена "Организация на обединените нации (ООН)"?':
        ['ООН е международна организация, създадена официално на 24 октомври 1945 г.'],
    'Кое твърдение за България не е вярно?':
        ['България не е федеративна държава. Пример за държави с федеративно управление са САЩ и Австралия.'],
    'Кое от изброените не е държавен символ?': ['Държавните граници не са национален символ.'],
    'Кой от празниците не е официален в България?':
        ['6-ти Декември не е национален празник. Прочети за Никулден тук: https://bulgarianhistory.org/nikulden/'],
    'Как се казва хубавицата, която турците искат да вземат в народната песен "Даваш ли, даваш, Балканджи Йово"?':
        ['Верен отговор, Яна.']

}

awards = {
    1: 100,
    2: 200,
    3: 300,
    4: 400,
    5: 500,
    6: 1000,
    7: 1500,
    8: 2000,
    9: 3000,
    10: 5000,
    11: 10000,
    12: 20000,
    13: 30000,
    14: 50000,
    15: 100000
}


def get_questions():
    generate_questions = []

    for _ in range(5):
        result = random.choice(easy_questions)
        generate_questions.append(result)
        easy_questions.remove(result)

    for _ in range(5):
        result = random.choice(normal_questions)
        generate_questions.append(result)
        normal_questions.remove(result)

    for _ in range(5):
        result = random.choice(professional_questions)
        generate_questions.append(result)
        professional_questions.remove(result)

    return generate_questions


def ask_player(question):
    answers = possible_answers[question]
    print(f'{question_number + 1}.{question}')
    print(LINE)

    for index in range(len(answers)):
        print(f'{index + 1}) {answers[index]}')


print('Играем "Знаеш или не знаеш" ... Сега!')
print()


questions = get_questions()

current_money = 0
question_number = 0
profit = 0

while len(questions) > 0:
    current_question = questions[0]
    ask_player(current_question)
    print(LINE)
    player_choice = input('Моля изберете число от 1 до 4: ')
    print()

    if player_choice != '1' and player_choice != '2' and player_choice != '3' and player_choice != '4':
        print('Въведохте невалиден отговор, моля, опитайте отново.')
        continue
    else:
        question_number += 1
        player_choice = int(player_choice) - 1
        if possible_answers[current_question][player_choice] != correct_answer[current_question][0]:
            print('Грешен отговор!')
            print(LINE)
            print(explanations[current_question][0])
            print(LINE)
            break
        else:
            current_money = awards[question_number]
            print('Правилен отговор!')
            questions.remove(current_question)
            if len(questions) > 0:
                print(f'Спечелени пари до момента {current_money} лева.')
            print()

            if question_number % 5 == 0:
                profit = current_money

if len(questions) == 0:
    print(f'Поздравления Вие отговорихте на всички въпроси и си тръгвате от шоуто със {profit} лева!')
else:
    print(f'Вие си тръгвате от шоуто със {profit} лева!')
